Pandas - Series & Dataframes

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import glob
import re
import math

In [2]:
import warnings
warnings.filterwarnings("ignore")

Series

Create Series

In [3]:
# Create series from Nump Array
v = np.array([1,2,3,4,5,6,7])
s1 = pd.Series(v)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [4]:
#Datatype of Series
s1.dtype

dtype('int32')

In [6]:
s1.items

<bound method Series.items of 0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32>

In [7]:
# Number of bytes consumed by Series
s1.nbytes

28

In [8]:
# Shape of the Series
s1.shape

(7,)

In [9]:
# number of dimensions
s1.ndim

1

In [10]:
# Length of Series
len(s1)

7

In [11]:
s1.count()

7

In [12]:
s1.size

7

In [13]:
# Create series from List
s0 = pd.Series([1,2,3],index = ['a','b','c'])
s0

a    1
b    2
c    3
dtype: int64

In [14]:
# Modifying index in Series
s1.index = ['a' , 'b' , 'c' , 'd' , 'e' , 'f' , 'g']
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [15]:
# Create Series using Random and Range function
v2 = np.random.random(10)
ind2 = np.arange(0,10)
s = pd.Series(v2,ind2)
v2 , ind2 , s

(array([0.01989736, 0.00231073, 0.58895459, 0.65473006, 0.53144475,
        0.0324373 , 0.48933144, 0.26343076, 0.71353243, 0.81913766]),
 array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 0    0.019897
 1    0.002311
 2    0.588955
 3    0.654730
 4    0.531445
 5    0.032437
 6    0.489331
 7    0.263431
 8    0.713532
 9    0.819138
 dtype: float64)

In [16]:
# Creating Series from Dictionary
dict1 = {'a1' :10 , 'a2' :20 , 'a3':30 , 'a4':40}
s3 = pd.Series(dict1)
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [17]:
pd.Series(99, index=[0, 1, 2, 3, 4, 5])

0    99
1    99
2    99
3    99
4    99
5    99
dtype: int64

Slicing Series

In [18]:
s

0    0.019897
1    0.002311
2    0.588955
3    0.654730
4    0.531445
5    0.032437
6    0.489331
7    0.263431
8    0.713532
9    0.819138
dtype: float64

In [19]:
# Return all elements of the series
s[:]

0    0.019897
1    0.002311
2    0.588955
3    0.654730
4    0.531445
5    0.032437
6    0.489331
7    0.263431
8    0.713532
9    0.819138
dtype: float64

In [20]:
# First three element of the Series
s[0:3]

0    0.019897
1    0.002311
2    0.588955
dtype: float64

In [21]:
# Last element of the Series
s[-1:]

9    0.819138
dtype: float64

In [22]:
# Fetch first 4 elements in a series
s[:4]

0    0.019897
1    0.002311
2    0.588955
3    0.654730
dtype: float64

In [23]:
# Return all elements of the series except last two elements.
s[:-2]

0    0.019897
1    0.002311
2    0.588955
3    0.654730
4    0.531445
5    0.032437
6    0.489331
7    0.263431
dtype: float64

In [24]:
# Return all elements of the series except last element.
s[:-1]

0    0.019897
1    0.002311
2    0.588955
3    0.654730
4    0.531445
5    0.032437
6    0.489331
7    0.263431
8    0.713532
dtype: float64

In [25]:
# Return last two elements of the series
s[-2:]

8    0.713532
9    0.819138
dtype: float64

In [26]:
# Return last element of the series
s[-1:]

9    0.819138
dtype: float64

In [27]:
s[-3:-1]

7    0.263431
8    0.713532
dtype: float64

Append Series

In [28]:
s2 = s1.copy()
s2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [29]:
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [30]:
# Append S2 & S3 Series
s4 = s2.append(s3)
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [31]:
# When "inplace=False" it will return a new copy of data with the operation performed
s4.drop('a4' , inplace=False)

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
dtype: int64

In [32]:
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [33]:
# When we use "inplace=True" it will affect the dataframe
s4.drop('a4', inplace=True)
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
dtype: int64

In [34]:
s4 = s4.append(pd.Series({'a4': 7}))
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
a4     7
dtype: int64

Operation on Series

In [35]:
v1 = np.array([10,20,30])
v2 = np.array([1,2,3])
s1 = pd.Series(v1)
s2 = pd.Series(v2)
s1 , s2

(0    10
 1    20
 2    30
 dtype: int32,
 0    1
 1    2
 2    3
 dtype: int32)

In [36]:
# Addition of two series
s1.add(s2)

0    11
1    22
2    33
dtype: int32

In [37]:
# Subtraction of two series
s1.sub(s2)

0     9
1    18
2    27
dtype: int32

In [38]:
# Subtraction of two series
s1.subtract(s2)

0     9
1    18
2    27
dtype: int32

In [39]:
# Increment all numbers in a series by 9
s1.add(9)

0    19
1    29
2    39
dtype: int32

In [40]:
# Multiplication of two series
s1.mul(s2)

0    10
1    40
2    90
dtype: int32

In [41]:
# Multiplication of two series
s1.multiply(s2)

0    10
1    40
2    90
dtype: int32

In [42]:
# Multiply each element by 1000
s1.multiply(1000)

0    10000
1    20000
2    30000
dtype: int32

In [43]:
# Division
s1.divide(s2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [44]:
# Division
s1.div(s2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [45]:
# MAX number in a series
s1.max()

30

In [46]:
# Min number in a series
s1.min()

10

In [47]:
# Average
s1.mean()

20.0

In [48]:
# Median
s1.median()

20.0

In [49]:
# Standard Deviation
s1.std()

10.0

In [50]:
# Series comparison
s1.equals(s2)

False

In [51]:
s4 =s1

In [52]:
# Series comparison
s1.equals(s4)

True

In [53]:
s5 = pd.Series([1,1,2,2,3,3], index=[0, 1, 2, 3, 4, 5])
s5

0    1
1    1
2    2
3    2
4    3
5    3
dtype: int64

In [54]:
s5.value_counts()

1    2
2    2
3    2
dtype: int64

DataFrame

Create DataFrame

In [55]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [56]:
# Create Dataframe using List
lang = ['Java' , 'Python' , 'C' , 'C++']
df = pd.DataFrame(lang)
df

        0
0    Java
1  Python
2       C
3     C++

In [57]:
# Add column in the Dataframe
rating = [1,2,3,4]
df[1] = rating
df

        0  1
0    Java  1
1  Python  2
2       C  3
3     C++  4

In [58]:
df.columns = ['Language','Rating']

In [59]:
df

  Language  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [60]:
# Create Dataframe from Dictionary
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df2 = pd.DataFrame(data)
df3 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b'])
df4 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'c'])
df5 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'c' , 'd'])

In [61]:
df2

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [62]:
df3

      a   b
row1  1   2
row2  5  10

In [63]:
df4

      a   b     c
row1  1   2   NaN
row2  5  10  20.0

In [64]:
df5

      a   b     c   d
row1  1   2   NaN NaN
row2  5  10  20.0 NaN

In [65]:
# Create Dataframe from Dictionary
df0 = pd.DataFrame({'ID' :[1,2,3,4] , 'Name' :['Asif' , 'Basit' , 'Ross' , 'John']})
df0

   ID   Name
0   1   Asif
1   2  Basit
2   3   Ross
3   4   John

In [66]:
# Create a DataFrame from Dictionary of Series
dict = {'A' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
'B' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df1 = pd.DataFrame(dict)
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

In [67]:
dates = pd.date_range(start='2020-01-20', end='2020-01-26')
dates

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [68]:
dates = pd.date_range('today',periods= 7)
dates

DatetimeIndex(['2023-02-23 05:59:27.085628', '2023-02-24 05:59:27.085628',
               '2023-02-25 05:59:27.085628', '2023-02-26 05:59:27.085628',
               '2023-02-27 05:59:27.085628', '2023-02-28 05:59:27.085628',
               '2023-03-01 05:59:27.085628'],
              dtype='datetime64[ns]', freq='D')

In [69]:
dates = pd.date_range(start='2020-01-20', periods=7)
dates

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [70]:
M = np.random.random((7,7))
M

array([[0.35062808, 0.72870787, 0.52814682, 0.75584915, 0.07542611,
        0.60590731, 0.18598899],
       [0.01400773, 0.88881287, 0.60184639, 0.33758069, 0.16167689,
        0.24769837, 0.56252134],
       [0.29420587, 0.17843814, 0.68013043, 0.13706285, 0.8558363 ,
        0.3775395 , 0.70310147],
       [0.46139182, 0.31609534, 0.69157498, 0.32716605, 0.65611358,
        0.75377894, 0.07502911],
       [0.59092344, 0.77026585, 0.21111731, 0.63674775, 0.60020619,
        0.90355498, 0.92377409],
       [0.25957211, 0.24044685, 0.09321364, 0.54593199, 0.07975168,
        0.47152464, 0.12339863],
       [0.25031522, 0.42817053, 0.95018198, 0.56502067, 0.1096237 ,
        0.32703836, 0.72962322]])

In [71]:
dframe = pd.DataFrame(M , index=dates)
dframe

,0,1,2,3,4,5,6
2020-01-20,0.350628,0.728708,0.528147,0.755849,0.075426,0.605907,0.185989
2020-01-21,0.014008,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-22,0.294206,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-23,0.461392,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774
2020-01-25,0.259572,0.240447,0.093214,0.545932,0.079752,0.471525,0.123399
2020-01-26,0.250315,0.428171,0.950182,0.565021,0.109624,0.327038,0.729623

In [72]:
#Changing Column Names
dframe.columns = ['C1' , 'C2' , 'C3', 'C4', 'C5', 'C6', 'C7']
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.350628,0.728708,0.528147,0.755849,0.075426,0.605907,0.185989
2020-01-21,0.014008,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-22,0.294206,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-23,0.461392,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774
2020-01-25,0.259572,0.240447,0.093214,0.545932,0.079752,0.471525,0.123399
2020-01-26,0.250315,0.428171,0.950182,0.565021,0.109624,0.327038,0.729623

In [73]:
# List Index
dframe.index

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [74]:
# List Column Names
dframe.columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7'], dtype='object')

In [75]:
# Datatype of each column
dframe.dtypes

C1    float64
C2    float64
C3    float64
C4    float64
C5    float64
C6    float64
C7    float64
dtype: object

In [76]:
# Sort Dataframe by Column 'C1' in Ascending Order
dframe.sort_values(by='C1')

,C1,C2,C3,C4,C5,C6,C7
2020-01-21,0.014008,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-26,0.250315,0.428171,0.950182,0.565021,0.109624,0.327038,0.729623
2020-01-25,0.259572,0.240447,0.093214,0.545932,0.079752,0.471525,0.123399
2020-01-22,0.294206,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-20,0.350628,0.728708,0.528147,0.755849,0.075426,0.605907,0.185989
2020-01-23,0.461392,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774

In [77]:
# Sort Dataframe by Column 'C1' in Descending Order
dframe.sort_values(by='C1' , ascending=False)

,C1,C2,C3,C4,C5,C6,C7
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774
2020-01-23,0.461392,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-20,0.350628,0.728708,0.528147,0.755849,0.075426,0.605907,0.185989
2020-01-22,0.294206,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-25,0.259572,0.240447,0.093214,0.545932,0.079752,0.471525,0.123399
2020-01-26,0.250315,0.428171,0.950182,0.565021,0.109624,0.327038,0.729623
2020-01-21,0.014008,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521

Delete Column in DataFrame

In [78]:
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

In [79]:
# Delete Column using "del" function
del df1['B']

In [80]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [81]:
df5

      a   b     c   d
row1  1   2   NaN NaN
row2  5  10  20.0 NaN

In [82]:
# Delete Column using pop()
df5.pop('c')

row1     NaN
row2    20.0
Name: c, dtype: float64

In [83]:
df5

      a   b   d
row1  1   2 NaN
row2  5  10 NaN

In [84]:
dict = {'A' : pd.Series([1, 2, 3,11], index=['a', 'b', 'c','d']),
'B' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df12 = pd.DataFrame(dict)
df12

    A  B
a   1  1
b   2  2
c   3  3
d  11  4

In [85]:
df12.drop(['A'], axis=1,inplace=True)
df12

   B
a  1
b  2
c  3
d  4

Delete Rows in DataFrame

In [86]:
col1 = np.linspace(10, 100, 30)
col2 = np.random.randint(10,100,30)
df10 = pd.DataFrame({"C1" : col1 , "C2" :col2})
df10

            C1  C2
0    10.000000  75
1    13.103448  30
2    16.206897  83
3    19.310345  45
4    22.413793  18
5    25.517241  38
6    28.620690  59
7    31.724138  63
8    34.827586  34
9    37.931034  21
10   41.034483  22
11   44.137931  84
12   47.241379  70
13   50.344828  63
14   53.448276  36
15   56.551724  32
16   59.655172  89
17   62.758621  75
18   65.862069  47
19   68.965517  91
20   72.068966  66
21   75.172414  92
22   78.275862  53
23   81.379310  92
24   84.482759  88
25   87.586207  53
26   90.689655  10
27   93.793103  72
28   96.896552  92
29  100.000000  92

In [87]:
# Delete rows with index values 17,18,19
df10 = df10.drop([17,18,19], axis=0)
df10

            C1  C2
0    10.000000  75
1    13.103448  30
2    16.206897  83
3    19.310345  45
4    22.413793  18
5    25.517241  38
6    28.620690  59
7    31.724138  63
8    34.827586  34
9    37.931034  21
10   41.034483  22
11   44.137931  84
12   47.241379  70
13   50.344828  63
14   53.448276  36
15   56.551724  32
16   59.655172  89
20   72.068966  66
21   75.172414  92
22   78.275862  53
23   81.379310  92
24   84.482759  88
25   87.586207  53
26   90.689655  10
27   93.793103  72
28   96.896552  92
29  100.000000  92

In [88]:
# Delete rows with index values 16 without using assignment operation
df10.drop([16], axis=0,inplace=True)
df10

            C1  C2
0    10.000000  75
1    13.103448  30
2    16.206897  83
3    19.310345  45
4    22.413793  18
5    25.517241  38
6    28.620690  59
7    31.724138  63
8    34.827586  34
9    37.931034  21
10   41.034483  22
11   44.137931  84
12   47.241379  70
13   50.344828  63
14   53.448276  36
15   56.551724  32
20   72.068966  66
21   75.172414  92
22   78.275862  53
23   81.379310  92
24   84.482759  88
25   87.586207  53
26   90.689655  10
27   93.793103  72
28   96.896552  92
29  100.000000  92

In [89]:
df10.drop(df10.index[5] , inplace=True)
df10

            C1  C2
0    10.000000  75
1    13.103448  30
2    16.206897  83
3    19.310345  45
4    22.413793  18
6    28.620690  59
7    31.724138  63
8    34.827586  34
9    37.931034  21
10   41.034483  22
11   44.137931  84
12   47.241379  70
13   50.344828  63
14   53.448276  36
15   56.551724  32
20   72.068966  66
21   75.172414  92
22   78.275862  53
23   81.379310  92
24   84.482759  88
25   87.586207  53
26   90.689655  10
27   93.793103  72
28   96.896552  92
29  100.000000  92

In [90]:
#Delete first three rows
df10 = df10.iloc[3:,]
df10

            C1  C2
3    19.310345  45
4    22.413793  18
6    28.620690  59
7    31.724138  63
8    34.827586  34
9    37.931034  21
10   41.034483  22
11   44.137931  84
12   47.241379  70
13   50.344828  63
14   53.448276  36
15   56.551724  32
20   72.068966  66
21   75.172414  92
22   78.275862  53
23   81.379310  92
24   84.482759  88
25   87.586207  53
26   90.689655  10
27   93.793103  72
28   96.896552  92
29  100.000000  92

In [91]:
#Delete last four rows
df10 = df10.iloc[:-4,]
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
9   37.931034  21
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63
14  53.448276  36
15  56.551724  32
20  72.068966  66
21  75.172414  92
22  78.275862  53
23  81.379310  92
24  84.482759  88
25  87.586207  53

In [92]:
#Keep top 10 rows
df10 = df10.iloc[:10,]
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
9   37.931034  21
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63

In [93]:
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
9   37.931034  21
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63

In [94]:
df10.index[df10['C2'] == 56].tolist()

[]

In [95]:
# Delete row based on Column value
df10.drop(df10.index[df10['C2'] == 56].tolist() , axis=0,inplace=True)
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
9   37.931034  21
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63

In [96]:
# Delete row based on Column value
df10 = df10.drop(df10[df10["C2"]==79].index)
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
9   37.931034  21
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63

In [97]:
# Delete all rows with column C2 value 14
df10 = df10[df10.C2 != 44]
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
9   37.931034  21
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63

In [98]:
# Delete all rows with column C2 value 88 & 55 using isin operator
df10 = df10[~(df10.C2.isin ([21,48]))]
df10

           C1  C2
3   19.310345  45
4   22.413793  18
6   28.620690  59
7   31.724138  63
8   34.827586  34
10  41.034483  22
11  44.137931  84
12  47.241379  70
13  50.344828  63

In [99]:
# Keep all rows with column C2 value 10,89,31 & 64 using isin operator
df10 = df10[df10.C2.isin ([42,76])]
df10

Empty DataFrame
Columns: [C1, C2]
Index: []

In [100]:
dict = {'A' : pd.Series([1, 2, 3,11], index=['a', 'b', 'c','d']),
'B' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df11 = pd.DataFrame(dict)
df11

    A  B
a   1  1
b   2  2
c   3  3
d  11  4

In [101]:
#Delete all rows with label "d"
df11.drop("d", axis=0,inplace=True)
df11

   A  B
a  1  1
b  2  2
c  3  3

In [102]:
df13 = pd.DataFrame({'ID' :[1,2,3,4] ,
                     'Name' :['Asif' , 'Basit' , 'Ross' , 'John'] ,
                     'location' : ['India' , 'Australia','UK' , 'US'] })
df13

   ID   Name   location
0   1   Asif      India
1   2  Basit  Australia
2   3   Ross         UK
3   4   John         US

In [103]:
ind = df13[((df13.Name == 'Ross') &(df13.ID == 3) & (df13.location == 'UK'))].index
df13.drop(ind,inplace=True)
df13

   ID   Name   location
0   1   Asif      India
1   2  Basit  Australia
3   4   John         US

Data Selection in Dataframe

In [104]:
df

  Language  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [105]:
df.index = [1,2,3,4]
df

  Language  Rating
1     Java       1
2   Python       2
3        C       3
4      C++       4

In [106]:
# Data selection using row label
df.loc[1]

Language    Java
Rating         1
Name: 1, dtype: object

In [107]:
# Data selection using position (Integer Index based)
df.iloc[1]

Language    Python
Rating           2
Name: 2, dtype: object

In [108]:
df.loc[1:2]

  Language  Rating
1     Java       1
2   Python       2

In [109]:
df.iloc[1:2]

  Language  Rating
2   Python       2

In [110]:
# Data selection based on Condition
df.loc[df.Rating > 2]

  Language  Rating
3        C       3
4      C++       4

In [111]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [112]:
# Row & Column label based selection
df1.loc['a']

A    1.0
Name: a, dtype: float64

In [113]:
df1.iloc['a'] # This will throw error because iloc will not work on labels

TypeError: Cannot index by location index with a non-integer key

In [114]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.350628,0.728708,0.528147,0.755849,0.075426,0.605907,0.185989
2020-01-21,0.014008,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-22,0.294206,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-23,0.461392,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774
2020-01-25,0.259572,0.240447,0.093214,0.545932,0.079752,0.471525,0.123399
2020-01-26,0.250315,0.428171,0.950182,0.565021,0.109624,0.327038,0.729623

In [115]:
# Data selection using Row Label
dframe['2020-01-20' : '2020-01-22' ]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.350628,0.728708,0.528147,0.755849,0.075426,0.605907,0.185989
2020-01-21,0.014008,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-22,0.294206,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101

In [116]:
# Selecting all rows & selected columns
dframe.loc[:,['C1' , 'C7']]

                  C1        C7
2020-01-20  0.350628  0.185989
2020-01-21  0.014008  0.562521
2020-01-22  0.294206  0.703101
2020-01-23  0.461392  0.075029
2020-01-24  0.590923  0.923774
2020-01-25  0.259572  0.123399
2020-01-26  0.250315  0.729623

In [117]:
#row & column label based selection
dframe.loc['2020-01-20' : '2020-01-22',['C1' , 'C7']]

                  C1        C7
2020-01-20  0.350628  0.185989
2020-01-21  0.014008  0.562521
2020-01-22  0.294206  0.703101

In [118]:
# Data selection based on Condition
dframe[dframe['C1'] > 0.5]

,C1,C2,C3,C4,C5,C6,C7
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774

In [119]:
# Data selection based on Condition
dframe[(dframe['C1'] > 0.5) & (dframe['C4'] > 0.5)]

,C1,C2,C3,C4,C5,C6,C7
2020-01-24,0.590923,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774

In [120]:
# Data selection using position (Integer Index based)
dframe.iloc[0][0]

0.3506280808548802

In [121]:
# Select all rows & first three columns
dframe.iloc[:,0:3]

                  C1        C2        C3
2020-01-20  0.350628  0.728708  0.528147
2020-01-21  0.014008  0.888813  0.601846
2020-01-22  0.294206  0.178438  0.680130
2020-01-23  0.461392  0.316095  0.691575
2020-01-24  0.590923  0.770266  0.211117
2020-01-25  0.259572  0.240447  0.093214
2020-01-26  0.250315  0.428171  0.950182

In [122]:
dframe.iloc[0][0] = 10

In [123]:
# Display all rows where C1 has value of 10 or 20
dframe[dframe['C1'].isin([10,20])]

              C1        C2        C3        C4        C5        C6        C7
2020-01-20  10.0  0.728708  0.528147  0.755849  0.075426  0.605907  0.185989

Set Value

In [124]:
# Set value of 888 for all elements in column 'C1'
dframe['C1'] = 888
dframe

             C1        C2        C3        C4        C5        C6        C7
2020-01-20  888  0.728708  0.528147  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813  0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438  0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095  0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266  0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447  0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171  0.950182  0.565021  0.109624  0.327038  0.729623

In [125]:
# Set value of 777 for first three rows in Column 'C6'
dframe.at[0:3,'C6'] = 777

InvalidIndexError: slice(0, 3, None)

In [126]:
dframe

             C1        C2        C3        C4        C5        C6        C7
2020-01-20  888  0.728708  0.528147  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813  0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438  0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095  0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266  0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447  0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171  0.950182  0.565021  0.109624  0.327038  0.729623

In [127]:
# Set value of 333 in first row and third column
dframe.iat[0,2] = 333

In [128]:
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  333.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [129]:
dframe.iloc[0,2] = 555
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [130]:
# Create Copy of the calling objects data along with indices.
# Modifications to the data or indices of the copy will not be reflected in the original ob
dframe1 = dframe.copy(deep=True)

In [131]:
dframe1[(dframe1['C1'] > 0.5) & (dframe1['C4'] > 0.5)] = 0

In [132]:
dframe1[dframe1['C1'] == 0]

            C1   C2   C3   C4   C5   C6   C7
2020-01-20   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-24   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-25   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-26   0  0.0  0.0  0.0  0.0  0.0  0.0

In [133]:
# Replace zeros in Column C1 with 99
dframe1[dframe1['C1'].isin([0])] = 99
dframe1

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,99,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
2020-01-21,888,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-22,888,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-23,888,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-24,99,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
2020-01-25,99,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
2020-01-26,99,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000

In [134]:
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [135]:
# Display all rows where value of C1 is 99
dframe1[dframe1['C1'] == 99]

            C1    C2    C3    C4    C5    C6    C7
2020-01-20  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-24  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-25  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-26  99  99.0  99.0  99.0  99.0  99.0  99.0

Dealing with NULL Values

In [136]:
dframe.at[0:8 , 'C7'] = np.NaN
dframe.at[0:2 , 'C6'] = np.NaN
dframe.at[5:6 , 'C5'] = np.NaN
dframe

InvalidIndexError: slice(0, 8, None)

In [137]:
# Detect Non-Missing Values
# It will return True for NOT-NULL values and False for NULL values
dframe.notna()

              C1    C2    C3    C4    C5    C6    C7
2020-01-20  True  True  True  True  True  True  True
2020-01-21  True  True  True  True  True  True  True
2020-01-22  True  True  True  True  True  True  True
2020-01-23  True  True  True  True  True  True  True
2020-01-24  True  True  True  True  True  True  True
2020-01-25  True  True  True  True  True  True  True
2020-01-26  True  True  True  True  True  True  True

In [138]:
# Detect Missing or NULL Values
# It will return True for NULL values and False for NOT-NULL values
dframe.isna()

               C1     C2     C3     C4     C5     C6     C7
2020-01-20  False  False  False  False  False  False  False
2020-01-21  False  False  False  False  False  False  False
2020-01-22  False  False  False  False  False  False  False
2020-01-23  False  False  False  False  False  False  False
2020-01-24  False  False  False  False  False  False  False
2020-01-25  False  False  False  False  False  False  False
2020-01-26  False  False  False  False  False  False  False

In [139]:
# Fill all NULL values with 1020
dframe = dframe.fillna(1020)
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [140]:
dframe.at[0:5 , 'C7'] = np.NaN
dframe.at[0:2 , 'C6'] = np.NaN
dframe.at[5:6 , 'C5'] = np.NaN
dframe

InvalidIndexError: slice(0, 5, None)

In [141]:
# Replace Null values in Column 'C5' with number 123
# Replace Null values in Column 'C6' with number 789
dframe.fillna(value={'C5' : 123 , 'C6' : 789})

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [142]:
#Replace first NULL value in Column C7 with 789
dframe.fillna(value={'C7' : 789} , limit=1)

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [143]:
# Drop Rows with NULL values
dframe.dropna()

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [144]:
# Drop Columns with NULL values
dframe.dropna(axis='columns')

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [145]:
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [146]:
# Drop Rows with NULL values present in C5 or C6
dframe.dropna(subset=['C5' ,'C6'])

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

Descriptive Statistics

In [147]:
# Fill NULL values with 55
dframe.fillna(55 , inplace=True)
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [148]:
# Mean of all Columns
dframe.mean()

C1    888.000000
C2      0.507277
C3     79.746866
C4      0.472194
C5      0.362662
C6      0.526720
C7      0.471920
dtype: float64

In [149]:
# Max value per column
dframe.max()

C1    888.000000
C2      0.888813
C3    555.000000
C4      0.755849
C5      0.855836
C6      0.903555
C7      0.923774
dtype: float64

In [150]:
# Min value per column
dframe.min()

C1    888.000000
C2      0.178438
C3      0.093214
C4      0.137063
C5      0.075426
C6      0.247698
C7      0.075029
dtype: float64

In [151]:
# Median
dframe.median()

C1    888.000000
C2      0.428171
C3      0.680130
C4      0.545932
C5      0.161677
C6      0.471525
C7      0.562521
dtype: float64

In [152]:
dframe.std() #Standard Deviation

C1      0.000000
C2      0.284577
C3    209.567141
C4      0.213330
C5      0.329830
C6      0.239046
C7      0.339849
dtype: float64

In [153]:
dframe.var() #Variance

C1        0.000000
C2        0.080984
C3    43918.386714
C4        0.045510
C5        0.108788
C6        0.057143
C7        0.115497
dtype: float64

In [154]:
#Lower Quartile / First Quartile
dframe.quantile(0.25)

C1    888.000000
C2      0.278271
C3      0.406482
C4      0.332373
C5      0.094688
C6      0.352289
C7      0.154694
Name: 0.25, dtype: float64

In [155]:
#Second Quartile / Median
dframe.quantile(0.50)

C1    888.000000
C2      0.428171
C3      0.680130
C4      0.545932
C5      0.161677
C6      0.471525
C7      0.562521
Name: 0.5, dtype: float64

In [156]:
# Upper Quartile
dframe.quantile(0.75)

C1    888.000000
C2      0.749487
C3      0.820878
C4      0.600884
C5      0.628160
C6      0.679843
C7      0.716362
Name: 0.75, dtype: float64

In [157]:
#IQR (Interquartile Range)
dframe.quantile(0.75) - dframe.quantile(0.25)

C1    0.000000
C2    0.471216
C3    0.414397
C4    0.268511
C5    0.533472
C6    0.327554
C7    0.561669
dtype: float64

In [158]:
# SUM of column values
dframe.sum()

C1    6216.000000
C2       3.550937
C3     558.228065
C4       3.305359
C5       2.538634
C6       3.687042
C7       3.303437
dtype: float64

In [159]:
# GENERATES DESCRIPTIVE STATS
dframe.describe()

          C1        C2          C3        C4        C5        C6        C7
count    7.0  7.000000    7.000000  7.000000  7.000000  7.000000  7.000000
mean   888.0  0.507277   79.746866  0.472194  0.362662  0.526720  0.471920
std      0.0  0.284577  209.567141  0.213330  0.329830  0.239046  0.339849
min    888.0  0.178438    0.093214  0.137063  0.075426  0.247698  0.075029
25%    888.0  0.278271    0.406482  0.332373  0.094688  0.352289  0.154694
50%    888.0  0.428171    0.680130  0.545932  0.161677  0.471525  0.562521
75%    888.0  0.749487    0.820878  0.600884  0.628160  0.679843  0.716362
max    888.0  0.888813  555.000000  0.755849  0.855836  0.903555  0.923774

In [160]:
#Return unbiased skew
dframe.skew()

C1    0.000000
C2    0.228277
C3    2.645740
C4   -0.352088
C5    0.572006
C6    0.555875
C7   -0.034237
dtype: float64

In [161]:
# Return unbiased kurtosis using Fishers definition of kurtosis
dframe.kurt()

C1    0.000000
C2   -2.090184
C3    6.999956
C4   -0.736853
C5   -1.902395
C6   -0.967026
C7   -2.067038
dtype: float64

In [162]:
#Correlation
dframe.corr()

    C1        C2        C3        C4        C5        C6        C7
C1 NaN       NaN       NaN       NaN       NaN       NaN       NaN
C2 NaN  1.000000  0.342967  0.454732 -0.356171  0.113562  0.280129
C3 NaN  0.342967  1.000000  0.585848 -0.383901  0.145457 -0.370785
C4 NaN  0.454732  0.585848  1.000000 -0.633665  0.380721 -0.093428
C5 NaN -0.356171 -0.383901 -0.633665  1.000000  0.384828  0.300632
C6 NaN  0.113562  0.145457  0.380721  0.384828  1.000000 -0.070726
C7 NaN  0.280129 -0.370785 -0.093428  0.300632 -0.070726  1.000000

In [163]:
#Covariance
dframe.cov()

     C1         C2            C3         C4         C5        C6         C7
C1  0.0   0.000000      0.000000   0.000000   0.000000  0.000000   0.000000
C2  0.0   0.080984     20.453916   0.027606  -0.033431  0.007725   0.027092
C3  0.0  20.453916  43918.386714  26.191514 -26.535867  7.286850 -26.407734
C4  0.0   0.027606     26.191514   0.045510  -0.044586  0.019415  -0.006774
C5  0.0  -0.033431    -26.535867  -0.044586   0.108788  0.030342   0.033699
C6  0.0   0.007725      7.286850   0.019415   0.030342  0.057143  -0.005746
C7  0.0   0.027092    -26.407734  -0.006774   0.033699 -0.005746   0.115497

In [164]:
import statistics as st
dframe.at[3:6,'C1'] = 22
dframe

InvalidIndexError: slice(3, 6, None)

In [165]:
# Average
st.mean(dframe['C1'])

888

In [166]:
# Hormonic Mean
st.harmonic_mean(dframe['C1'])

888.0

In [167]:
#Returns average of the two middle numbers when length is EVEN
arr = np.array([1,2,3,4,5,6,7,8])
st.median(arr)

4.5

In [168]:
# low median of the data with EVEN length
st.median_low(arr)

4

In [169]:
# High median of the data with EVEN length
st.median_high(arr)

5

In [170]:
# Mode of Dataset
st.mode(dframe['C7'])

0.18598898742980519

In [171]:
# Sample Variance
st.variance(dframe['C1'])

0

In [172]:
#Population Variance
st.pvariance(dframe['C1'])

0

In [173]:
#Sample Standard Deviation
st.stdev(dframe['C1'])

0.0

In [174]:
#Population Standard Deviation
st.pstdev(dframe['C1'])

0.0

Apply function on Dataframe

In [175]:
dframe

             C1        C2          C3        C4        C5        C6        C7
2020-01-20  888  0.728708  555.000000  0.755849  0.075426  0.605907  0.185989
2020-01-21  888  0.888813    0.601846  0.337581  0.161677  0.247698  0.562521
2020-01-22  888  0.178438    0.680130  0.137063  0.855836  0.377540  0.703101
2020-01-23  888  0.316095    0.691575  0.327166  0.656114  0.753779  0.075029
2020-01-24  888  0.770266    0.211117  0.636748  0.600206  0.903555  0.923774
2020-01-25  888  0.240447    0.093214  0.545932  0.079752  0.471525  0.123399
2020-01-26  888  0.428171    0.950182  0.565021  0.109624  0.327038  0.729623

In [176]:
# Finding MAX value in Columns
dframe.apply(max)

C1    888.000000
C2      0.888813
C3    555.000000
C4      0.755849
C5      0.855836
C6      0.903555
C7      0.923774
dtype: float64

In [177]:
# Finding minimum value in Columns
dframe.apply(min)

C1    888.000000
C2      0.178438
C3      0.093214
C4      0.137063
C5      0.075426
C6      0.247698
C7      0.075029
dtype: float64

In [178]:
#Sum of Column Values
dframe.apply(sum)

C1    6216.000000
C2       3.550937
C3     558.228065
C4       3.305359
C5       2.538634
C6       3.687042
C7       3.303437
dtype: float64

In [179]:
#Sum of Column Values
dframe.apply(np.sum)

C1    6216.000000
C2       3.550937
C3     558.228065
C4       3.305359
C5       2.538634
C6       3.687042
C7       3.303437
dtype: float64

In [180]:
# Sum of rows
dframe.apply(np.sum ,axis=1)

2020-01-20    1445.351879
2020-01-21     890.800137
2020-01-22     890.932109
2020-01-23     890.819758
2020-01-24     892.045666
2020-01-25     889.554267
2020-01-26     891.109658
Freq: D, dtype: float64

In [181]:
# Square root of all values in a DataFrame
dframe.applymap(np.sqrt)

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,29.799329,0.853644,23.558438,0.869396,0.274638,0.778400,0.431264
2020-01-21,29.799329,0.942769,0.775788,0.581017,0.402091,0.497693,0.750014
2020-01-22,29.799329,0.422419,0.824700,0.370220,0.925114,0.614442,0.838511
2020-01-23,29.799329,0.562224,0.831610,0.571984,0.810008,0.868204,0.273914
2020-01-24,29.799329,0.877648,0.459475,0.797965,0.774730,0.950555,0.961132
2020-01-25,29.799329,0.490354,0.305309,0.738872,0.282403,0.686677,0.351281
2020-01-26,29.799329,0.654347,0.974773,0.751679,0.331095,0.571873,0.854180

In [182]:
# Square root of all values in a DataFrame
dframe.applymap(math.sqrt)

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,29.799329,0.853644,23.558438,0.869396,0.274638,0.778400,0.431264
2020-01-21,29.799329,0.942769,0.775788,0.581017,0.402091,0.497693,0.750014
2020-01-22,29.799329,0.422419,0.824700,0.370220,0.925114,0.614442,0.838511
2020-01-23,29.799329,0.562224,0.831610,0.571984,0.810008,0.868204,0.273914
2020-01-24,29.799329,0.877648,0.459475,0.797965,0.774730,0.950555,0.961132
2020-01-25,29.799329,0.490354,0.305309,0.738872,0.282403,0.686677,0.351281
2020-01-26,29.799329,0.654347,0.974773,0.751679,0.331095,0.571873,0.854180

In [183]:
dframe.applymap(float)

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888.0,0.728708,555.000000,0.755849,0.075426,0.605907,0.185989
2020-01-21,888.0,0.888813,0.601846,0.337581,0.161677,0.247698,0.562521
2020-01-22,888.0,0.178438,0.680130,0.137063,0.855836,0.377540,0.703101
2020-01-23,888.0,0.316095,0.691575,0.327166,0.656114,0.753779,0.075029
2020-01-24,888.0,0.770266,0.211117,0.636748,0.600206,0.903555,0.923774
2020-01-25,888.0,0.240447,0.093214,0.545932,0.079752,0.471525,0.123399
2020-01-26,888.0,0.428171,0.950182,0.565021,0.109624,0.327038,0.729623

In [184]:
# Using Lambda function in Dataframes
dframe.apply(lambda x: min(x))

C1    888.000000
C2      0.178438
C3      0.093214
C4      0.137063
C5      0.075426
C6      0.247698
C7      0.075029
dtype: float64

In [185]:
# Using Lambda function in Dataframes
dframe.apply(lambda x: x*x)

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,788544,0.531015,308025.000000,0.571308,0.005689,0.367124,0.034592
2020-01-21,788544,0.789988,0.362219,0.113961,0.026139,0.061354,0.316430
2020-01-22,788544,0.031840,0.462577,0.018786,0.732456,0.142536,0.494352
2020-01-23,788544,0.099916,0.478276,0.107038,0.430485,0.568183,0.005629
2020-01-24,788544,0.593309,0.044571,0.405448,0.360247,0.816412,0.853359
2020-01-25,788544,0.057815,0.008689,0.298042,0.006360,0.222335,0.015227
2020-01-26,788544,0.183330,0.902846,0.319248,0.012017,0.106954,0.532350

Merge Dataframes

In [186]:
daf1 = pd.DataFrame ({'id': ['1', '2', '3', '4', '5'], 
                      'Name': ['Miranda', 'Santos', 'Maria', 'Caique', 'Lauro']})
daf1

  id     Name
0  1  Miranda
1  2   Santos
2  3    Maria
3  4   Caique
4  5    Lauro

In [187]:
daf2 = pd.DataFrame ({'id': ['1', '2', '6', '7', '8'], 'Score': [40 , 60 , 80 , 90 , 70]})
daf2

  id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

In [188]:
# Inner Join
pd.merge(daf1, daf2, on='id', how='inner')

  id     Name  Score
0  1  Miranda     40
1  2   Santos     60

In [189]:
# Full Outer Join
pd.merge(daf1, daf2, on='id', how='outer')

  id     Name  Score
0  1  Miranda   40.0
1  2   Santos   60.0
2  3    Maria    NaN
3  4   Caique    NaN
4  5    Lauro    NaN
5  6      NaN   80.0
6  7      NaN   90.0
7  8      NaN   70.0

In [190]:
# Left Outer Join
pd.merge(daf1, daf2, on='id', how='left')

  id     Name  Score
0  1  Miranda   40.0
1  2   Santos   60.0
2  3    Maria    NaN
3  4   Caique    NaN
4  5    Lauro    NaN

In [191]:
#Right Outer Join
pd.merge(daf1, daf2, on='id', how='right')

  id     Name  Score
0  1  Miranda     40
1  2   Santos     60
2  6      NaN     80
3  7      NaN     90
4  8      NaN     70

Importing multiple CSV files in DataFrame

In [ ]:
# Append all CSV files
path =r'C:\Users\DELL\Documents\GitHub\Public\COVID-19\COVID-19\csse_covid_19_data\csse_cov
filenames = glob.glob(path + "/*.csv")
covid = pd.DataFrame()

for f in filenames:
    df = pd.read_csv(f)
    covid = covid.append(df,ignore_index=True,sort=True)

In [ ]:
# Top 10 rows of the Dataframe
covid.head(10)

In [ ]:
# Bottom 10 rows of the Dataframe
covid.tail(10)

In [ ]:
# Unique values in Country column
covid['Country/Region'].unique()

In [ ]:
# Number of Unique values in Country column
covid['Country/Region'].nunique()

In [ ]:
#Dataframe information
covid.info()

In [ ]:
# Reading columns
covid['Country/Region'].head(10)

In [ ]:
# Reading columns
df1 = covid[['Country/Region' ,'Province/State','Confirmed' , 'Last Update']]
df1.head(10)

In [ ]:
#Read specific rows
df1.iloc[1:4]

In [ ]:
#Filter data
df1.loc[df1['Country/Region'] == 'India']

In [ ]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country/Region'], ascending=True).head(5))

In [ ]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country/Region'], ascending=False).head(5))

In [ ]:
#Sort Data Frame - Ascending on "Country" & descending on "Last update"
display('Sorted Data Frame', df1.sort_values(['Country/Region', 'Last Update'], ascending=['Last update']))

In [ ]:
#Iterating through the dataset
for index , row in df1.iterrows():
    if (row['Country/Region'] == 'Indonesia' ):
        display(row[['Country/Region' ,'Confirmed']])

In [ ]:
#Unique Values
covid['Country/Region'].drop_duplicates(keep='first').head(10)

In [ ]:
# Countries impacted with Coronavirus
countries = covid['Country/Region'].unique()
type(countries) , countries

In [ ]:
# Countries impacted with Coronavirus
countries = covid['Country/Region'].unique()
type(countries) , countries

In [ ]:
# Sum of Columns
df2['Total'] = df2['HP'] + df2['Attack']
df2.head(5)

In [ ]:
# Sum of Columns
df2['Total'] = df2.iloc[:,4:10].sum(axis=1)
df2.head(5)

In [ ]:
#Shifting "Total" column
cols = list(df2.columns)
df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

In [ ]:
#Shifting "Legendary" column - Index location -1 or 12
cols = list(df2.columns)
df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

In [ ]:
#Shifting "Generation" column - Index location -1 or 12
cols = list(df2.columns)
df2 = df2[cols[0:10] + [cols[12]] + cols[10:12]]
df2.head(5)

In [ ]:
#Save to CSV file
df2.to_csv('poke_updated.csv')

In [ ]:
#Save to CSV file without index column
df2.to_csv('poke_updated1.csv', index=False)

In [ ]:
df2.head(10)

In [ ]:
# Save Dataframe as text file
df2.to_csv('poke.txt' , sep='\t' , index=False)

In [ ]:
# Save Dataframe as xlsx file
df2.to_excel('poke.xlsx')

In [ ]:
# Save Dataframe as xlsx file without row names
df2.to_excel('poke.xlsx', index=0)

In [ ]:
#Filtering using loc
df2.loc[df2['Type 2'] == 'Dragon']

In [ ]:
#Filtering using loc
df3 = df2.loc[(df2['Type 2'] == 'Dragon') & (df2['Type 1'] == 'Dark')]
df3

In [ ]:
#Reset index for Dataframe df3 keeping old index column
df4 = df3.reset_index()
df4

In [ ]:
#Reset index for Dataframe df3 removing old index column
df3.reset_index(drop=True , inplace=True)
df3

In [ ]:
df2.head(10)

LIKE OPERATION IN PANDAS

In [ ]:
df2.Name.str.contains("rill").head(10)

In [ ]:
# Display all rows containing Name "rill"
df2.loc[df2.Name.str.contains("rill")]

In [ ]:
# Exclude all rows containing "rill"
df2.loc[~df2.Name.str.contains("rill")].head(10)

In [ ]:
#Display all rows with Type-1 as "Grass" and Type-2 as "Poison"
df2.loc[df2['Type 1'].str.contains("Grass") & df2['Type 2'].str.contains("Poison")]

In [ ]:
df2.loc[df2['Type 1'].str.contains('Grass|Water',regex = True)].head(10)

In [ ]:
# Due to Case-sensitive it will not return any data
df2.loc[df2['Type 1'].str.contains('grass|water',regex = True)].head(10)

In [ ]:
# To ignore case we can use "case = False"
df2.loc[df2['Type 1'].str.contains('grass|water', case = False ,regex = True)].head(10)

In [ ]:
# To ignore case we can use "Flags = re.I"
df2.loc[df2['Type 1'].str.contains('grass|water',flags = re.I ,regex = True)].head(10)

Regex in Pandas dataframe

In [ ]:
#Get all rows with name starting with "wa"
df2.loc[df2.Name.str.contains('^Wa',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with "wa" followed by any letter between a-l
df2.loc[df2.Name.str.contains('^Wa[a-l]+',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with x , y, z
df2.loc[df2.Name.str.contains('^[x-z]',flags = re.I ,regex = True)]

In [ ]:
# Extracting first 3 characters from "Name" column
df2['Name2'] = df2.Name.str.extract(r'(^\w{3})')

In [ ]:
df2.head(5)

In [ ]:
# Return all rows with "Name" starting with character 'B or b'
df2.loc[df2.Name.str.match(r'(^[B|b].*)')].head(5)

Replace values in dataframe

In [ ]:
df2.head(10)

In [ ]:
df2['Type 1'] = df2['Type 1'].replace({"Grass" : "Meadow" , "Fire" :"Blaze"})

In [ ]:
df2.head(10)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace({"Poison" : "Venom"})

In [ ]:
df2.head(5)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace(['Venom' , 'Dragon'] , 'DANGER')

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Type 2'] == 'DANGER' , 'Name2'] = np.NaN

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Name2' , 'Legendary']] = 'ALERT'
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Legendary' , 'Name2']] = ['ALERT-1' , 'ALERT-2']
df2.head(10)

Group By

In [ ]:
df = pd.read_csv('poke_updated1.csv')
df.head(5)

In [ ]:
df.groupby(['Type 1']).mean().head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Attack' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Defense' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Speed' , ascending = False).head(10)

In [ ]:
df.sum()

In [ ]:
df.groupby(['Type 2']).sum().head(5)

In [ ]:
df.count()

In [ ]:
df['count1'] = 0
df.groupby(['Type 2']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1' , 'Type 2' , 'Legendary']).count()['count1']

Loading Data in Chunks

In [ ]:
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    print(df)

In [ ]:
df

In [ ]:
df1 = pd.DataFrame()
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    df1 = pd.concat([df1 ,df])

df1.head(15)

Stack & unstack in Pandas

In [ ]:
col = pd.MultiIndex.from_product([['2010','2015'],['Literacy' , 'GDP']])
data =([[80,7,88,6],[90,8,92,7],[89,7,91,8],[87,6,93,8]])
df6 = pd.DataFrame(data, index=['India','USA' , 'Russia' , 'China'], columns=col)
df6

In [ ]:
# Stack() Function stacks the columns to rows.
st_df = df6.stack()
st_df

In [ ]:
#Unstacks the row to columns
unst_df = st_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

PIVOT Tables

In [ ]:
data = {'Country':['India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India',],
        'Year':['2010','2010','2010','2010' , '2010','2010','2010','2010','2015','2015','2015',],
        'Literacy/GDP':['GDP' , 'GDP' , 'GDP' , 'GDP','Literacy' , 'Literacy', 'Literacy' , 'Li'],
        'Value':[7,8,7,6,80,90,89,87,6,7,8, 8, 88 , 92 , 91 ,93]}
        
df7 = pd.DataFrame(data,columns=['Country','Year','Literacy/GDP','Value'])
df7

In [ ]:
# Pivot table with SUM aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='sum')

In [ ]:
# Pivot table with MEAN aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='mean')

Hierarchical indexing